12/data/attachments/2c6a9cfb0b7f6a75.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_65f8c294-a64a-4bc2-a466-5d184e4ae4e4</nif:username>
            <nif:friendToBeAdded>Matthew_look_Friend_39597_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>